{ 
  "punishments": {
    "CBT": {
      "short": [
        "Put clothes pins on your sack for 2 minutes",
        "Put clothes pins on your sack for 3 minutes",
        "Put clothes pins on your sack for 4 minutes",
        "Put clothes pins on your sack for 5 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 1 minute",
        "Put as many clothes pins on your ball sack as long as you can for 2 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 3 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 4 minutes"
      ],
      "long": [
        "Put clothes pins on your sack for 6 minutes",
        "Put clothes pins on your sack for 7 minutes",
        "Put clothes pins on your sack for 8 minutes",
        "Put clothes pins on your sack for 9 minutes",
        "Put clothes pins on your sack for 10 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 5 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 6 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 7 minutes",
        "Put as many clothes pins on your ball sack as long as you can for 8 minutes"
      ]
    },
    "Humiliation": {
      "short": [
        "Jerk a dildo for 5 minutes instead of your own cock",
        "Jerk a dildo for 10 minutes instead of your own cock",
        "Jerk a dildo for 20 minutes instead of your own cock",
        "Watch porn while humping a pillow for 5 minutes",
        "Watch porn while humping a pillow for 10 minutes",
        "Watch porn while humping a pillow for 15 minutes",
        "Corner Time! hold a coin for 5 minutes against the wall with your nose",
        "Corner Time! hold a coin for 8 minutes against the wall with your nose",
        "Corner Time! hold a coin for 10 minutes against the wall with your nose",
        "Dance naked only in your cage while wearing nipple clamps for 1 minute",
        "Dance naked only in your cage while wearing nipple clamps for 2 minutes"
      ],
      "long": [
        "Jerk a dildo for 30 minutes instead of your own cock",
        "Jerk a dildo for 40 minutes instead of your own cock",
        "Jerk a dildo for 50 minutes instead of your own cock",
        "Watch porn while humping a pillow for 20 minutes",
        "Watch porn while humping a pillow for 25 minutes",
        "Watch porn while humping a pillow for 30 minutes",
        "Corner Time! hold a coin for 13 minutes against the wall with your nose",
        "Corner Time! hold a coin for 15 minutes against the wall with your nose",
        "Corner Time! hold a coin for 20 minutes against the wall with your nose",
        "Dance naked only in your cage while wearing nipple clamps for 3 minutes",
        "Dance naked only in your cage while wearing nipple clamps for 4 minutes"
      ]
    },
    "Edging": {
      "short": [
        "Edge yourself 2 times",
        "Edge yourself 3 times",
        "Edge yourself 4 times",
        "Edge yourself 5 times"
      ],
      "long": [
        "Edge yourself 6 times",
        "Edge yourself 7 times",
        "Edge yourself 8 times",
        "Edge yourself 9 times",
        "Edge yourself 10 times"
      ]
    },
    "Pain": {
      "short": [
        "Whip your ass 5 times",
        "Whip your ass 10 times",
        "Whip your balls 2 times",
        "Whip your balls 3 times",
        "Whip your balls 4 times",
        "Use nipple clamps for 5 minutes",
        "Use nipple clamps for 8 minutes",
        "Use nipple clamps for 10 minutes",
        "Kneel on uncooked rice for 2 minutes",
        "Kneel on uncooked rice for 3 minutes",
        "Kneel on uncooked rice for 4 minutes",
        "Slap your penis 2 times",
        "Slap your penis 3 times",
        "Slap your penis 4 times",
        "Slap your penis 5 times"
      ],
      "long": [
        "Whip your ass 15 times",
        "Whip your ass 20 times",
        "Whip your balls 5 times",
        "Whip your balls 6 times",
        "Whip your balls 7 times",
        "Use nipple clamps for 15 minutes",
        "Use nipple clamps for 20 minutes",
        "Use nipple clamps for 30 minutes",
        "Kneel on uncooked rice for 5 minutes",
        "Kneel on uncooked rice for 6 minutes",
        "Kneel on uncooked rice for 7 minutes",
        "Kneel on uncooked rice for 8 minutes",
        "Slap your penis 6 times",
        "Slap your penis 7 times",
        "Slap your penis 8 times",
        "Slap your penis 9 times"
      ]
    },
    "Anal": {
      "short": [
        "Butt plug for 5 minutes",
        "Butt plug for 10 minutes",
        "Butt plug for 15 minutes",
        "Ride your dildo for 10 minutes",
        "Ride your dildo for 15 minutes",
        "Ride your dildo for 20 minutes",
        "Ride your dildo for 25 minutes",
        "Ride your dildo for 30 minutes"
      ],
      "long": [
        "Butt plug for 20 minutes",
        "Butt plug for 30 minutes",
        "Butt plug for 60 minutes",
        "Ride your dildo for 35 minutes",
        "Ride your dildo for 40 minutes",
        "Ride your dildo for 45 minutes",
        "Ride your dildo for 50 minutes",
        "Ride your dildo for 55 minutes"
      ]
    },
    "Chastity": {
      "short": [
        "Watch porn without touching yourself for 10 minutes",
        "Watch porn without touching yourself for 20 minutes",
        "Watch porn without touching yourself for 30 minutes"
      ],
      "long": [
        "Watch porn without touching yourself for 40 minutes",
        "Watch porn without touching yourself for 50 minutes",
        "Watch porn without touching yourself for 60 minutes"
      ]
    }
  }
}
